       01 test-1.
          03 f1                   pic x(3).
          03 f2-comp              pic s9(4)    comp.
          03 f3-comp-3            pic s9(6)V99 comp-3.
