       01  XXXRECORD.

           05  XXXBal1                       PIC S9(11)V99   COMP-3.
           05  XXXBal2                       PIC S9(11)V99   COMP-3.
               88 oooo                         VALUE -999999999.99 THRU
                                                     -000000000.01.
           05  XXXBal3                    PIC S9(13)V99   COMP-3.
           05  XXXBal4                    PIC S9(11)V99   COMP-3.
           05  XXXBal5                    PIC S999        COMP-3.