       01 Ams-Vendor.
           03 Brand               Pic x(3).
           03 Address-3           Pic X(35).
           03 before-blah         PIC S9(8) COMP.
           03 blah                POINTER.
           03 afterblah           PIC X(12).
           03 Postcode            Pic 9(4).
