         01  SREC.                                                                
             05  SFIELD                PIC S9(7)V99.                              
