         01  SRECSEP.                                                             
              05  SFIELD-SEP            PIC S9(7)V99 SIGN IS                       
                                              LEADING SEPARATE.          
