       * Sample copybook with international characters in UTF8   *
       ***********************************************************
        01  TEST.
            03 CHINESE-SIMPLIFIED     PIC X(50)  VALUE '当世界'.
            03 CHINESE-TRADITIONAL    PIC X(50)  VALUE '當世界'.
            03 DANISH                 PIC X(50)  VALUE 'når verden'.
            03 KOREAN                 PIC X(50)  VALUE '때 세계'.
            03 JAPANESE               PIC X(50)  VALUE '時の世界'.
            03 RUSSIAN                PIC X(50)  VALUE 'когда мир'.
