002100     02  LINE-8.                                                  00000120
002110         03  FILLER8       PIC X(103) VALUE                       00000130
002120    "      SSN       ""FILE NO.""  DESIGNATOR     DATE OF BIRTH  A00000140
002130-    "GE    PROF.SERV.DATE       FOR BOARD USE   ".               
