           05 Brand-T                            PIC X(3).
           05 Location-Number-T                  PIC 9(4).
           05 Location-Type-T                    PIC X(2).
           05 Location-Name-T                    PIC X(35).
           05 Address-1-T                        PIC X(40).
           05 Address-2-T                        PIC X(40).
           05 Address-3-T                        PIC X(35).
           05 Postcode-T                         PIC 9(4).
           05 Empty-T                            PIC X(6).
           05 State-T                            PIC X(3).
           05 Location-Active-T                  PIC X(1).
