000019 01  RENTAL-RECORD.
000020     05  REN-CONTRACT-NO           PIC 9(6).
000021     05  REN-NAME.
000022         10  REN-LAST-NAME         PIC X(15).
000023         10  REN-FIRST-NAME        PIC X(10).
000024         10  REN-INITIAL           PIC X.
000025     05  REN-RETURNED-DATE.
000026         10  REN-RETURNED-YEAR     PIC 9(2).
000027         10  REN-RETURNED-MONTH    PIC 9(2).
000028             88  VALID-MONTHS          VALUES 1 THRU 12.
000029             88  FEBRUARY              VALUE 2.
000030             88  D30-DAY-MONTH         VALUES 4 6 9 11.
000031             88  D31-DAY-MONTH         VALUES 1 3 5 7 8 10 12.
000032         10  REN-RETURNED-DAY      PIC 9(2).
000033     05  REN-CAR-TYPE              PIC X.
000034         88  VALID-CAR-TYPES           VALUES 'E' 'C' 'M' 'F' 'L'.
000035     05  REN-DAYS-RENTED           PIC 99.
000036         88  ZERO-DAYS-RENTED          VALUE  0.
000037         88  VALID-DAYS-RENTED         VALUES 1 THRU 35.
000038     05  REN-MILEAGE.
000039         10  REN-MILES-IN          PIC 9(6).
000040         10  REN-MILES-OUT         PIC 9(6).
000041         10  REN-MILEAGE-RATE      PIC 99.
000042             88  VALID-MILEAGE-RATES   VALUES 00 THRU 50.
000043     05  REN-INSURANCE             PIC X.
000044         88  VALID-INSURANCE           VALUES 'Y' 'N'.
