      *    Test various unusual situations
      *
            10 TOP-LEVEL-ITEM.
	           15 date-field           pic 9(8).
	           15 p-pic-101            pic s999ppp.
	           15 p-pic-102            pic s999pppvp.
               15 p-pic-103            pic s999pppvpp.
               15 p-pic-104            pic s999pppvppp.
               15 p-pic-121            pic svppp999.
               15 p-pic-122            pic spvppp999.
               15 p-pic-123            pic sppvppp999.
               15 p-pic-124            pic spppvppp999.
               
               15 p-pic-201            pic s999ppp     comp.
	           15 p-pic-202            pic s999pppvp   comp.
               15 p-pic-203            pic s999pppvpp  comp.
               15 p-pic-204            pic s999pppvppp comp.
               15 p-pic-221            pic svppp999    comp.
               15 p-pic-222            pic spvppp999   comp.
               15 p-pic-223            pic sppvppp999  comp.
               15 p-pic-224            pic spppvppp999 comp.
                        
               15 p-pic-301            pic s999ppp     comp-3.
	           15 p-pic-302            pic s999pppvp   comp-3.
               15 p-pic-303            pic s999pppvpp  comp-3.
               15 p-pic-304            pic s999pppvppp comp-3.
               15 p-pic-321            pic svppp999    comp-3.
               15 p-pic-322            pic spvppp999   comp-3.
               15 p-pic-323            pic sppvppp999  comp-3.
               15 p-pic-324            pic spppvppp999 comp-3.
               
                                       
               15 p-pic-501            pic s999ppp     comp-5.
	           15 p-pic-502            pic s999pppvp   comp-5.
               15 p-pic-503            pic s999pppvpp  comp-5.
               15 p-pic-504            pic s999pppvppp comp-5.
               15 p-pic-521            pic svppp999    comp-5.
               15 p-pic-522            pic spvppp999   comp-5.
               15 p-pic-523            pic sppvppp999  comp-5.
               15 p-pic-524            pic spppvppp999 comp-5.
               
               
               
               