000049 01  SALES-RECORD-IN.
000050     05  SR-ACCOUNT-NUMBER         PIC 9(6).
000051     05  FILLER                    PIC X.
000052     05  SR-NAME                   PIC X(15).
000053     05  SR-SALES                  PIC S9(4).
000054     05  FILLER                    PIC XX.
000055     05  SR-COMMISSION-PERCENT     PIC V99.
000056     05  FILLER                    PIC XX.
000057     05  SR-LOCATION               PIC X(15).
000058     05  SR-REGION                 PIC X(11).

