      ***************************************
      *  basic N/G picture clause checking
      ***************************************

       01 Rec.
          03 Group1.           
            05  fld1             pic x.
            05  fld2             pic n.
            05                   pic x.
            05  fld3             pic n(3).
            05                   pic x.
            05  fld4             pic g.
            05                   pic x.
            05  fld5             pic g(3).     
            05  fld6             pic x.
         03 fld7                 pic xxx.