002100     02  LINE-8.                                                  00000120
002110         03  FILLER8       PIC X(1000) VALUE                      00000130
002120     '<---                       1                            --->00000140
002130-    '<---                       2                            --->00000150
002130-    '<---                       3                            --->00000160
002130-    '<---                       4                            --->00000170
002130-    '<---                       5        --->'.