         01 Group-0001.
            03 Field-0002                     Pic x(3).
            03 Field-0003                     Pic 9(4).
            03 Field-0004                     Pic XX.
            03 Field-0005                     Pic X(35).
            03 Field-0006                     Pic X(40).
            03 Field-0007                     Pic X(40).
            03 Field-0008                     Pic X(35).
            03 Field-0009                     Pic 9(4).
            03 Field-0010                     Pic X(6).
            03 Field-0011                     Pic XXX.
            03 Field-0012                     Pic X.
